Tekla.Structures.ModelInternal.RebarPropertiesNullable
This class defines the default properties of the bars in the set.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.#ctor
Initializes a new instance of the RebarPropertiesNullable class.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.CloneRebarPropertiesNullable
A clone of the RebarProperties object.
Returns: The Tekla.Structures.ModelInternal.RebarProperties.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.ToStruct(Tekla.Structures.ModelInternal.dotRebarProperties_t@)
The to struct.
p:
The p.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.FromStruct(Tekla.Structures.ModelInternal.dotRebarProperties_t@)
The from struct.
p:
The p.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.Size
Gets or sets the size of the reinforcement.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.Grade
Gets or sets the steel grade of the reinforcing bar.
The grade indicates the strength of the steel used in reinforcing bars.
It can also indicate other factors, such as the weldability or surface deformations of the bar.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.Name
Gets or sets the name of the reinforcement.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.Class
Gets or sets the class of the reinforcement. The class is used to group reinforcements.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.Finish
Gets or sets the finish of the rebars.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.NumberingSeries
Gets or sets the numbering series of the reinforcement.

Tekla.Structures.ModelInternal.RebarPropertiesNullable.BendingRadius
Gets or sets the beding radius.